<a href="https://colab.research.google.com/github/ravillegan/42-piscine-c/blob/master/Tochka.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

df=pd.read_csv("/content/drive/My Drive/Копия edges.csv")

In [4]:
df

            id_1     id_2          value  n_transactions
0         878327  1133997  478035.238733      277.747437
1         707356  1341541  442189.669684       80.997950
2         169982   494074  353097.929209      287.789650
3         551010   979933  537749.674840      426.743337
4          76064   597023  418990.198382      287.789650
...          ...      ...            ...             ...
4685639   533291  1134794  275822.479741        1.000000
4685640   929970  1378868  507684.088750        1.000000
4685641    45803   829031  318785.728608        1.000000
4685642  1266550  1448478  494106.825312        1.000000
4685643    44951   995849  362288.948265        1.000000

[4685644 rows x 4 columns]